{"post_detail":
 {
  "title":"Click 3X Hires Megan Kelly as Executive Producer/Managing Director of Live Action",
  "client":"",
  "description":"Click 3X has added production and agency veteran Megan Kelly to its roster as executive producer and managing director of live action. In her new role, Kelly will be charged with oversight and expansion of Click 3X&#x2019;s already robust veteran roster of live-action directors, which includes Jonathan Yi, Juan Delcan, Simon Blake, and the duo of Josh and Vince. &#x201c;Megan brings a tremendous breadth and depth of knowledge to Click 3X&#x2019;s already very experienced roster,&#x201d; states company founder Peter Corbett. &#x201c;From founding her own international companies to working at all stations on the production pipeline, she has proven herself as one of the top overall talents in the industry today.&#x201d; &#x201c;Click 3X has amazing talent and an incredible facility, and is doing enormously exciting work,&#x201d; notes Kelly. &#x201c;I have been an admirer of their work for a very long time, and I look forward to helping the company develop their live-action capabilities even further. Our immediate priority will be expanding the roster with a diverse group of directing talent to produce amazing content across multiple platforms.&#x201d; A creative problem-solver with rich and varied production experience, Kelly is adept at working with nearly any conceivable combination of creative and budget. Prior to joining Click 3X, she helped to establish international production company Savage in the US and played a similar role with consultancy Runaway International. She honed her live-action skills at Shilo and worked on both digital content and broadcast spots at Publicis. Kelly also spent time as head of production at The Sweet Shop, Public Domain, and Czar.",
  "assets":[
   {
    "id":"1",
    "media_type":"2",
    "filename":"1_Megan_K",
    "title":"Click 3X Hires Megan Kelly as Executive Producer/Managing Director of Live Action"
   }
  ],
  "related_posts":[
  {
   "id":"444320",
   "media_type":"30",
   "detail_name":"people/megan_kelly",
   "filename":"Megan_K",
   "title":"Megan Kelly",
   "description":"Megan's career has encompassed both production company and agency",
   "page":"people"
   }
  ],
  "related_links":[
  {"href":"http://www.trustcollective.com/2013/06/07/click-3x-hires-megan-kelly-as-executive-producermanaging-director-of-live-action/", "title":"Megan Kelly"}
  ]
 }
}