{"post_detail":
 {
  "title":"Innovations",
  "client":"",
  "description":"With a growing portfolio of clever digital projects, ClickFire Media (CFM) has quickly established itself as an authority in using the full spectrum of social media tools to engage users in inventive and unexpected ways, maximizing the efficacy of any campaign.“As a company, we are fueled by a deep desire to explore,” noted CFM Creative Director Nick Agderian. “Think of the Jamaican tourist who sits at the resort and takes a tour bus into town, buying tchotchkes. That is not us. We are the ones sneaking off the resort grounds and wandering into a shanty bar with a guy called Dance Dance, having an adventure we will cherish forever. We are always looking for a new way to answer the question, and we are more than happy to take our clients along with us.” CFM’s work in the social media space has been impressive in its breadth and variety. For example, their Electrified campaign for Vice allowed users to create an electrified version of themselves on Twitter to mimic a stunt pulled off by David Blaine. The studio has built a fully functional social media site for AFS, a Facebook app for Estee Lauder and Breast Health Awareness, and augmented reality activations for Daffy’s and AT&T football. Much of CFM’s innovation emerges from an improvisational and inventive company culture that seeks to exploit each platform’s every available aspect. When designing a recent interactive mobile ventriloquist dummy app for GEICO, for example, the studio had to avoid using front or side controls in order to maintain the mystique of an independently operating talking puppet. They solved this problem by turning the phone’s backside camera into an input device that opens or closes the puppet’s mouth when the lens is blocked or unblocked.Such physical interactions with devices often create an extra layer of technical roadblocks, which CFM’s creative technologists identify and work out with the creatives at the beginning of the process. An augmented reality site for Daffy’s, for example, allowed users to blow out a virtual candle with a microphone, which presented the problem of working around varying hardware specs and user-set sensitivity levels. To avoid destroying the purity of the experience by requiring a complex battery of user adjustments, CFM developed a code that sampled the ambient background and determined an average silence, allowing a user to blow out the candle with nothing more than a puff into their microphone.“When we approach any project, we ask both pertinent and odd questions that are going to lead to interesting answers about the creative problem at hand,” explained CFM Head of Production Ephraim Kehlmann. “If you do that right, innovation will flow naturally, but it will never really feel like innovation, just the right answer.”",
  "assets":[
   {
    "id":"1",
    "media_type":"2",
    "filename":"2_clickfire-inovation",
    "title":"Innovations"
   }
  ],
  "related_posts":[
  ],
  "related_links":[
  {"href":"http://clickfiremedia.com/2013/index.php/about_us#/about_us/_all/9000", "title":"Innovations"}
  ]
 }
}