{"post_detail":
 {
  "title":"Click 3X Launches Raison D’Être, Summers Appointed as Director of Creative Strategy",
  "client":"",
  "description":"As high-end consumers converge upon the digital space, Click 3X is launching Raison D&#x2019;&Ecirc;tre a digital and video content company that will focus on putting fashion, beauty and luxury brands at the forefront of this ever-expanding domain. Internationally respected e-commerce and digital consultant Christan Summers will lead the new operation, which will harness the full range of offerings from Click 3X and its interactive division ClickFire Media to offer capabilities from concept to production to post, creating everything from websites to mobile apps to traditional TV spots to offline and in-store experiences. &#x201c;We have only grazed the surface of the potential for luxury clients in the digital space,&#x201d; explains Click 3X owner Peter Corbett  &#x201c;Our goal is to ease any fears beauty and luxury clients may have concerning their presence on the web and in mobile applications. To our team of creatives, &#x2018;digital&#x2019; is no longer a commercial idea, it is a tool to take advantage of and invite consumers to experience new elements of these brands.&#x201d;Summers will assume the role of director of creative &amp; strategy for Raison D&#x2019;&Ecirc;tre.  She brings a unique perspective to this position as the current founder/CEO of ICUINParis and Showroom ICU, which is both an online boutique specializing in independent, curated, unique designer jewelry and accessories from around the world and a BtoB consultancy.  Christan applied her extensive background in styling, creative direction and brand consultancy to grow and establish the now internationally-recognized e-boutique, best known today for discovering emerging talent and introducing them to the mainstream consumer marketplace. As head of Raison D&#x2019;Etre, Summers will focus first on consumer behavior and experience, striving to design campaigns that allow them to share, interact and experience a brand, with a bullseye on creating and maintaining the level of unattainability that is so key to the image of fashion, beauty &amp; luxury brands. &#x201c;Offering an experience is crucial when working with beauty and luxury clients,&#x201d; states Summers. &#x201c;Fashion, beauty and luxury clients are naturally unique, and if you are not offering them a creative, technical and experiential &#x2018;wow&#x2019; factor, you may as well pack your bags and go. Most of these clients have worked very hard to build their brand&#x2019;s aesthetic, which is why there is a level of apprehension to entering the digital space. We are here to make sure that any move into digital involves beautiful, emotion-evoking work that does not compromise their hard-earned luxury status.&#x201d; Raison D&#x2019;&Ecirc;tre made a strong public debut in May when they hosted a stimulating panel series and cocktail reception at Internet Week 2013 in New York. The trio of panels hosted by Summers, DBA Managing Partner Kendra Bracken-Ferguson, and DBA CCO Karen Robinovitz explored storytelling, strategy and art in the digital age with panelists from top-tier brands and publications.",
  "assets":[
   {
    "id":"1",
    "media_type":"2",
    "filename":"3_r2b1",
    "title":"Click 3X Launches Raison D’Être, Summers Appointed as Director of Creative Strategy"
   }
  ],
  "related_posts":[
  ],
  "related_links":[
  {"href":"http://www.trustcollective.com/2013/05/28/click-3x-launches-raison-detre-summers-appointed-as-director-of-creative-strategy/", "title":"Raison D’Être"}
  ]
 }
}