{"post_detail":
 {
  "title":"Click 3X Brings Humor to “Variations on a Hail”",
  "client":"",
  "description":"The art of catching a cab is about to get a 21st century makeover, courtesy of a new app from the NYC Taxi and Limousine Commission. To welcome this new age of transportation, Flatiron-based production studio Click 3X has donated its considerable resources to create &#x201c;Variations on a Hail,&#x201d; a new spot developed by Cooke&amp;Co CD/Copywriter Marty Cooke, executed and financed entirely through Click 3X, and shot by Click 3X directors Josh Ruben &amp; Vince Peone.&#x201c;Variations on a Hail&#x201d; is a funny and educational video airing specifically on NYC taxi televisions. With a voiceover and appearance by NYC Taxi and Limousine Commissioner David Yassky listing all of the tried and true hailing &#x201c;techniques,&#x201d; the spot culminates with the most technologically advanced &#x201c;hail&#x201d; in history &#x2013; the TLC smartphone app that will allow users to contact nearby taxicabs. The app promises to make life easier should New Yorkers find themselves in need of a ride in an unfamiliar part of the city, late at night, or while rushing to their next appointment. A pro-bono project created for the benefit of the studio&#x2019;s beloved home city, Click 3X managed production and all the stages of post, including color grading, VFX, and finishing. Click 3X also drafted its friends at audio post studio Heard City to handle mix and sound design. The directorial duo, also known as j+v, earned its reputation as CollegeHumor.com&#x2019;s premiere video team &#x2013; producing, directing, and starring in hundreds of videos over their six-year residency there. They bring their tongue-in-cheek comedic tone to &#x201c;Variations on a Hail,&#x201d; imparting a fun and informative overall affect to the PSA.",
  "assets":[
   {
    "id":"1",
    "media_type":"2",
    "filename":"4_Hail_Story",
    "title":"Click 3X Brings Humor to “Variations on a Hail”"
   }
  ],
  "related_posts":[
    {
   "id":"40",
   "media_type":"2",
   "detail_name":"portfolio/josh_vince_nyc_taxi_hai",
   "filename":"josh_vince_NYC_Taxi_Hail",
   "title":"NYC Taxi Hail",
   "description":"Vincent Peone and Josh Ruben directing and starring in the PSA for the NY Taxi and Limousine Commission",
   "page":"portfolio"
   }
  ],
  "related_links":[
  {"href":"http://www.trustcollective.com/2013/04/25/click-3x-brings-humor-to-variations-on-a-hail/", "title":"Variations on a Hail"}
  ]
 }
}