{"post_detail":
 {
  "title":"“THE FORMER IS AT AN ALL-TIME HIGH WHILE THE LATTER IS LACKING IN VISUAL EFFECTS BUSINESS; INDUSTRY PROS OFFER FEEDBACK”",
  "client":"",
  "description":"Jason Says: &#x201d;1) Well, I&#x2019;ve read bits and pieces about what happened but I can&#x2019;t completely identify with the intricacy of the situation because we&#x2019;re not heavily invested in the feature film VFX side of things. The scale and magnitude of those types of projects are huge and the risk involved is tremendous. I have to say though that overall, I think the VFX business is in a good place. In today&#x2019;s landscape of tighter budgets and more condensed timing, you have to be prepared to problem-solve. Every problem has a solution but you have to be willing to think outside of the box. Whether it&#x2019;s developing partnerships with resources overseas, developing different and more efficient pipelines internally, or looking at a practical approach as opposed to the digital approach, we need to expand our thinking. We have artists that come from all sorts of disciplines here at Click 3X, which allows us to see things a bit differently. What I do think is most important is having a clear understanding between the client and the vendor about what is possible. If I am going to take the risk, I need to know that there are boundaries. It&#x2019;s my job to manage the expectations of my client and, in turn, it&#x2019;s their responsibility to manage the expectations of their client. Without that trust, we&#x2019;re all at risk. This business has never been stagnant. It&#x2019;s always changing. That&#x2019;s what makes it exciting.2) At Click 3X we deal with several different pipelines of work. We work with networks in the broadcast space, ClickFire Media works in the digital space, and we have a thriving content business. So, at any given time we could be shooting, editing, or doing VFX, animation, and design for commercials, designing and developing mobile apps, or Facebook experiences. Whatever it may be, chances are we&#x2019;re leveraging all of the resources we have in-house across all disciplines. One that stands out to me is a project we did with Bernstein Rein for Hostess. It was a complete content production package that included live-action production with comedy directors Josh Ruben and Vincent Peone, full postproduction and sound design, as well as full development of a Facebook tab and interactivity within each video. The six videos and the trailer video celebrate the every day accomplishments of each viewer, pulling information from their connected Facebook account. It allowed us to leverage our ability to combine our technological talents with our live-action film production capabilities to produce personalized, interactive videos with a higher audience engagement. These are the jobs we&#x2019;re seeing more and more of and we&#x2019;re well positioned to execute them at the highest level and still be able to maneuver around all of the usual challenges with budgets and schedules. I really feel that the point we&#x2019;re at right now as an industry is probably the most exciting time I&#x2019;ve been a part of. There are so many ways to reach an audience. It&#x2019;s up to us to keep pushing the boundaries.&#x201d;",
  "assets":[
   {
    "id":"1",
    "media_type":"2",
    "filename":"6_jasonm",
    "title":"“THE FORMER IS AT AN ALL-TIME HIGH WHILE THE LATTER IS LACKING IN VISUAL EFFECTS BUSINESS; INDUSTRY PROS OFFER FEEDBACK”"
   }
  ],
  "related_posts":[
  ],
  "related_links":[
  {"href":"http://www.shootonline.com/go/news-view.rs-web3-1499349-1366314610-2.Visual-Effects---Animation-Series--The-Imbalance-of-Art-vs--Commerce.html", "title":"Shoot"}
  ]
 }
}