{"post_detail":
 {
  "title":"MTV Video Awards",
  "client":"",
  "description":"Speed. Sex. Explosions. Stars. The postproduction pros at Click 3X deliver all these and more in a four-spot campaign promoting this year&#x2019;s MTV Movie Awards, continuing a long run of successful collaborations with the network. Postproduction master Mark Szumski, who acted as Click 3X creative director, senior VFX artist and colorist on the campaign, teamed up with Backyard Director Kim Nguyen and MTV on-air producer Kris Walter to deliver edit, GFX, visual effects and color grading on these hilarious action spoofs starring 2013 VMA host Rebel Wilson and actor Channing Tatum. The 2013 MTV Movie Awards campaign spoofs Tatum&#x2019;s upcoming White House Down with spots portraying the action star outrunning his attackers in a bullet-riddled SUV as an obliviously love-struck Rebel Wilson tricks and cajoles him into sexually uncomfortable situations. To create these hilariously harrowing scenes, Click 3X transformed a windshield-less SUV shot on rollers in a green screen stage into a fast-moving battle-scarred escape vehicle with the help of moving light rigs, stock and custom elements, and green screen comps melded to background footage from White House Down. &#x201c;Making the SUV appear to be battle-damaged as it lurched through a warzone was a priority for the promos,&#x201d; explains Szumski, who also paid homage to the feature films honored at the VMAs with a color grade specially designed to emulate the feel of a blockbuster action film, grading the footage using multiple Colour Warper nodes, among other techniques. The team was able to maintain this aesthetic even while handling the spots that called more overt visual effects &#x2013; including one memorable scene in which Wilson&#x2019;s hair suddenly bursts into flames.  &#x201c;For me, delivering that action-film look was one of the most rewarding aspects of this project,&#x201d; Szumski notes. Following previous work for MTV, including VMA campaigns that ran the gamut from a West Side Story retread to VFX-heavy superstar spotlights, Click 3X showcases its versatility with the Movie Award work by attacking a set of spots that are vastly different in both substance and delivery. &#x201c;We&#x2019;re proud of the fact that, while the creative and technical parameters for these promotions change wildly each year, Click 3X is able to pivot and respond with high-end creative finishing for each project, meeting the tightest deadlines and delivering various formats and versions,&#x201d; Szumski explains. &#x201c;The fact that we understand MTV&#x2019;s format and their complex production schedule gives us a tremendous head start and really speeds up the process. Plus, when you team up with outstanding talent like Kim and Kris, it&#x2019;s hard not to come out with something everyone can be proud of.&#x201d;",
  "assets":[
   {
    "id":"1",
    "media_type":"2",
    "filename":"ftp://click3x.com//var/www/html/click3x/click3x/data/c3x/blog/8_mtv_VMA.json",
    "title":"MTV Video Awards"
   }
   
  ],
  "related_posts":[
  {
   "id":"30",
   "media_type":"2",
   "detail_name":"portfolio/mtv_bra_30",
   "filename":"mtv_bra_30",
   "title":"MTV Video Awards",
   "description":"Mark Szumski, who acted as Click 3X creative director, senior VFX artist and colorist on the campaign.",
   "page":"portfolio"
   }
  ],
  "related_links":[
  {"href":"http://www.trustcollective.com/2013/04/15/click-3x-delivers-hijinks-with-channing-tatum-rebel-wilson-in-promos-for-mtv-movie-awards/", "title":"MTV Video Awards"}
  ]
 }
}