{"post_detail":
 {
  "title":"GLOSSI: DIGITAL MAGAZINES MADE EASY",
  "client":"ICUINPARIS",
  "description":"As an illustrator, I am always on the lookout for a beautiful, clean, and easy way to share my work with my audience. Since everything today is digital, it makes more sense to put together a portfolio that an art director can flip through on her tablet than to send a postcard or catalogue through the mail.  And if that digital portfolio is eye-catching and easy to navigate, all the better. During a recent Internet Week event hosted by Raison D&#x2019;&Ecirc;tre, of which ICU founder, Christan Summers is Creative Director, we met Matt Edelman, the founder of Glossi.com, a new platform allowing users to create and share interactive digital magazines.  Matt was a panelist for one of the discussions at the event; I was intrigued so did a bit of research post-event and learned a bit more&#x2026;The platform allows us to upload all images into a clippings catalogue, then, using their fully customizable templates, or starting from scratch, we are provided the option to build our own catalogue of works and embed it directly on my blog, website, or Facebook page.  For the e-commerce savvy, you&#x2019;ve been provided the advantage to create clickable links on images or text, and to insert animated GIFs, videos, and music, adding a new dimension to the way we communicate with viewers. Portfolio creation is only one of a myriad of possible uses for Glossi, which is being used to create lookbooks, mini magazines, cookbooks, portfolios, shoppable catalogues, how-to manuals and more.  Launched in December 2012, the goal was to change the way we consume digital content, which is exactly what I think Glossi is doing. Below are a couple examples of Glossi used well by major brands.  DKNY has been making digital publications since Glossi&#x2019;s launch, and used it most recently during their #DKNYARTWORKS campaign.  The first page of the magazine is immediately engaging with an eye-catching image, text, and and a video explaining the whole project. Olivia Palermo is one of many fashion designers to make shoppable trend books of her designs.  Here is a beautiful example of a trend page about the color yellow with links if you decide you can&#x2019;t live without those gorgeous clutches.",
  "assets":[
   {
    "id":"1",
    "media_type":"2",
    "filename":"Glossi_1",
    "title":"GLOSSI: DIGITAL MAGAZINES MADE EASY"
   },
   {
    "id":"2",
    "media_type":"2",
    "filename":"Glossi_2",
    "title":"GLOSSI: DIGITAL MAGAZINES MADE EASY"
   },
   {
    "id":"3",
    "media_type":"2",
    "filename":"Glossi_3",
    "title":"GLOSSI: DIGITAL MAGAZINES MADE EASY"
   },
   {
    "id":"4",
    "media_type":"2",
    "filename":"Glossi_4",
    "title":"GLOSSI: DIGITAL MAGAZINES MADE EASY"
   }
  ],
  "related_posts":[
  ],
  "related_links":[
  {"href":"https://www.icuinparis.com/blog/2013/06/11/glossi-digital-magazines-made-easy/", "title":"GLOSSI: DIGITAL"
}
  ]
 }
}