{"post_detail":
 {
  "title":"MAJ NEW YORK: CLASSIC, WITH A BOHEMIAN TWIST",
  "client":"ICUINPARIS",
  "description":"by JESSICA on APRIL 16, 2013 &#x00b7; in CREATIVES Marie Jarvis, designer of MAJ Jewelry, may be one of the only people in Manhattan who does not own a cell phone. She told me that as I was excusing myself for being a few minutes late, and I immediately appreciated her style. Soft spoken with a French accent, Marie and I dove into exchanging our stories, using a m&eacute;lange des mots en Fran&ccedil;aise et Anglais, of how we arrived sitting face &agrave; face in a Tribeca caf&eacute;. She started in France, on a path to the social norm with a college degree, the perfect man and a proud family standing beside. She realized this life wasn&#x2019;t it for her, and she returned to Indonesia, where she had spent a part of her childhood. It was there where she rediscovered senses she had lost throughout the years, and began exploring the idea of jewelry design. She met her now husband, in Bali (so very Eat, Pray, Love of her), and they returned to New York where she now makes her jewelry by hand in her Tribeca studio. Marie contacted me to speak about my work as a rep for independent designers; she would be the fourth designer I take under the repping wing of ICU. What I love about Marie is, for her, MAJ Jewelry is not a necessity, she is in no rush to be the next &#x201c;big thing&#x201d;; she loves creating and wants to grow slowly, patiently. In my experience, when you are on the right path, things happen. When you try to push something too hard or too soon, you break it, and more often than not, you are more frustrated in your efforts than is necessary. Soon to be sold on the ICU e-shop, as well as represented in the showroom, there is more to come from MAJ Jewelry and I am quite pleased to be a part of it.",
  "assets":[
   {
    "id":"1",
    "media_type":"2",
    "filename":"article_9_01",
    "title":"MAJ NEW YORK: CLASSIC, WITH A BOHEMIAN TWIST"
   }
  ],
  "related_posts":[
  ],
  "related_links":[
  {"href":"https://www.icuinparis.com/blog/2013/04/16/maj-new-york-classic-with-a-bohemian-twist/", "title":"MAJ NEW YORK"
}
  ]
 }
}