{"post_detail":
 {
  "title":"Jonathan Yi",
  "client":"Director/Cinematographer",
  "description":"Jonathan Yi is a freelance director and cinematographer, most often working in the realms of commercial production and documentary. His client list in the advertising world includes Nike, Smirnoff, Visine, Kleenex, JetBlue, Stride, Trident, Kotex, Microsoft, SAP, TD Ameritrade, Schick and Pepcid, among many others.<br/> <br/>Outside of the ad space, Yi has directed three installments of HBO&#x2019;s award-winning series East of Main Street and shot projects for Twisted Sister, Poison, Daniel Johnston, Mates of State and The Locust. Shift, a film that Jonathan shot, directed and produced, has also won many accolades and played in many film festivals.<br/> <br/>As a director/cinematographer, Yi&#x2019;s work has been showcased in such magazines as Creativity and Vice. MoMA at the AICP Awards honored him in 2006 for his work on Sushi for Monster.com.<br/> <br/>Yi teaches 16mm and digital cinematography at NYU&#x2019;s Tisch School of the Arts. He also consults for Canon USA, most recently on their 2011 Cinema EOS product line. His promo video for the EOS C300 went viral, gaining more than 270,000 plays and more than 4,500 Vimeo likes in less than one week.<br/> <br/>Yi attended New York University&#x2019;s Tisch School of the Arts Film Program.",
  "assets":[
   {
    "id":"1",
    "media_type":"2",
    "filename":"Jon_Yi",
    "title":"Jonathan Yi"
   }
  ],
  "related_posts":[
    {
   "id":"60",
   "media_type":"1",
   "filename":"dvf_01",
   "title":"DVF",
   "page":"portfolio"
   },
    {
   "id":"120",
   "media_type":"1",
   "filename":"Gawker_01",
   "title":"Gawker",
   "page":"portfolio"
   },
    {
   "id":"270",
   "media_type":"1",
   "filename":"sap_tommy_01",
   "title":"SAP and Tommy",
   "page":"portfolio"
   },
    {
   "id":"280",
   "media_type":"1",
   "filename":"Serpico_01",
   "title":"Serpico",
   "page":"portfolio"
   }
  ],
  "related_links":[
  ]
 }
}