{
   "post_detail":{
      "detail_name":"portfolio/jennie-o_videos",
      "filename":"Best_of_JA",
      "related_posts":[

      ],
      "client":"BBDO-MN",
      "related_links":[

      ],
      "description":"What this case study demonstrates:\nOur ability to combine event production with interactive development and video production. \nOur ability to collaborate amongst many different agency and client partners\n\nChallenge:\nClickfire Media worked with BBDO and their client, Jennie-O, to produce a \nfive-day, online and offline, multi-location marketing promotion across \nNew York City.  The goal was to create social buzz, brand awareness, \npositive social chatter, and increase social following. We paired up \nwith a popular food truck (Bistro Truck), and handed out thousands of \nfree turkey burgers in an effort to get New Yorkers to \"Make The Switch\"\n to Jennie-O turkey.\n\nExecution:\nUnique burger recipes using the Jennie-O product were created by Bistro Truck chef, Yassir, for each of 5 high-traffic locations in NYC.\n\nWe casted an improv comedy host to interview participants on the street, \nand we filmed at a different location each day of the 5-day promotion. \nWe also produced a “themed photo shoot,\" each day to add variety to the \ndigital content for the Facebook page. For instance, for the Mulberry \nStreet Burger, CFM took character portraits to create a vintage \nHipstamatic or Instagram styled photos, which were uploaded to the \nJennie-O page, where people were encouraged to like and tag themselves.\n\nCFM also shot, edited and produced a total of six creative videos \nencompassing everything from man-on-the-street style interviews to a day\n in the life of a Jennie-O turkey burger. All the music was original, \ncomposed by Click 3X Sound Designer Brian Scribinico.\n\nResults:\n2.5K+ turkey burgers handed out in 5 days\nProduced 6 creative videos, as well as man on the street Style footage for each day’s promotion for Facebook\n1 million+ impressions on Facebook\nThe Jennie-O Facebook page grew by 35K+ likes in less than a month\n25K+ of the likes came during the five-day promotion\nThousands of Facebook updates and tweets generated.",
      "title":"Jennie-O Videos",
      "assets":[
         {
            "id":"1",
            "description":"",
            "filename":"Best_of_JA",
            "title":"",
            "media_type":"1"
         },
         {
            "id":"2",
            "description":"",
            "filename":"Contest",
            "title":"",
            "media_type":"1"
         },
         {
            "id":"3",
            "description":"",
            "filename":"evangelist",
            "title":"",
            "media_type":"1"
         },
         {
            "id":"4",
            "description":"",
            "filename":"Make_Burge",
            "title":"",
            "media_type":"1"
         },
         {
            "id":"5",
            "description":"",
            "filename":"Puppet_The",
            "title":"",
            "media_type":"1"
         },
         {
            "id":"6",
            "description":"",
            "filename":"Turkey_Bur",
            "title":"",
            "media_type":"1"
         }
      ]
   }
}