{
   "post_detail":{
      "related_posts":[

      ],
      "assets":[
         {
            "id":"1",
            "description":"View our brand integration reel.",
            "media_type":"1",
            "title":"Brand Integration Reel",
            "filename":"BrandIntegrationReelFINAL"
         },
         {
            "id":"2",
            "description":"Brooklyn is rising! The big day is finally here, so to help kickoff the Brooklyn Nets inaugural season, The YES Network brought in Click3X to help usher the organization into a new era with a series of launch promos and promo toolkit for the 2012-2013 season.\n\nFor the campaign Click3X set out to create a “photo album” that exemplified Brooklyn’s character, exposing the audience to everything from iconic locations like Coney Island and the Brooklyn Bridge to the diverse population that proudly calls Brooklyn home.\n\nGiven the opportunity to shoot such world class athletes; we wanted to ensure that we captured the larger than life heroes that proud Brooklynites will watch every night and cheer onto victory. It was important to our approach that we made a visceral, personal connection with the players, to identify with them as they represent their home on the NBA’s stage.\n\nThe shoot, directed by Creative Director Ders Hallgren, utilized an up close and personal style of shooting, using short depth of field and an intimate look.  The players were invited to engage the viewers on an emotional level, through their eyes, facial expression and body language. The way they engaged and confronted the camera allowed us to set the mood and tone for the campaign, creating an intimate voice that increased their iconic stature and elevated them with a soft spoken integrity.\n\nGraphically our team heightened this attitude by challenging the beautiful and iconic photographs of the city with a splatter effect of paint and urban texture. These splatters happen quickly and deliberately to accentuate audio hits and keep the pace exciting.  These effects were used not only to build the stories for the :20 and :30 promos, but also to help accentuate footage and type in the promo toolkit's lower thirds and mortises.",
            "media_type":"1",
            "title":"Brooklyn Nets",
            "filename":"Yes_Nets_30_promo_1"
         },
         {
            "id":"3",
            "description":"When SyFy and CarFax paired up on an integrated marketing campaign, they turned to Click3X’s imagination for their “Imagine That” campaign.  Through a combination of 2D and 3D animation, our creative team was able to create a narrative that depicted the importance of a CarFax history report, while staying true to the SyFy branding palate. \n\nIn this :15 spot, the viewer follows a hero car into the SyFy logo, which then morphs into a fully composited 3D parking garage. The camera follows our hero car through the garage, passing by three cars that reveal the damaged history (lemon titles, flood damage, and severe accidents) their used car may have endured.  \n        \nSyfy and Click 3x have recently partnered on a series of integrated marketing campaigns that create a more cost-effective way for their sponsored transformations to take the brand attributes of a sponsor’s product and tie them in with the Syfy Brand and Imagine Greater.  The trick was also that these transformations also needed to help build a consistent campaign device that invited further interaction with the consumer at Syfy.com.   To date Click 3x has created campaigns for Bud Light, Hershey’s, Pep Boys, and Progresso Soup.",
            "media_type":"1",
            "title":"Carfax",
            "filename":"Carfax"
         },
         {
            "id":"4",
            "description":"Working with Director/DP Jon Yi, we produced, edited and created visual effects for this spot for Palladium Boots and VICE.",
            "media_type":"1",
            "title":"Palladium Boots",
            "filename":"Palladium_Assembled_V8_FU"
         },
         {
            "id":"5",
            "description":"MTV & Wrigley turned to Click 3X for the 2nd year in a row to help create the month long 'Best New Artist' promo campaign.  Coming off of last year's successful run, Click 3x and Click 3x Creative Director/VFX Artist Theo Maniatis upped the ante and rolled out 4 promos that comprised a narrative arc that celebrated Wrigley React 5's new ice-fly campaign by showing its journey from creation through space and into Los Angeles for the awards show.  Created in CG and composited in flame, the entire story was initially spread out through 4 promos, and was then pieced together for a 45 second in-show segment that announced the winner.",
            "media_type":"1",
            "title":"MTV Wrigley",
            "filename":"MTVWrigley_2011"
         },
         {
            "id":"6",
            "description":"Directed by Peter Corbett, we shot the talent on green screen and then added the liquid effects in Flame. Liquid effects were created using Real Flow software.",
            "media_type":"1",
            "title":"Madstyle",
            "filename":"MadStyle_Agency"
         },
         {
            "id":"7",
            "description":"How big of a deal is Lexus' all-new CT Hybrid? It was such a big deal that the legendary automakers launched the 45-video MSN.com Fresh Perspectives original series in late April as part of the launch campaign to introduce the new vehicle. Fresh Perspectives features six young artists - chef Craig Thornton, collage artist and painter Augustine Kofie, fashion designer Robert James, paper sculptor Jeff Nishinaka, singer-songwriter V, and photographer Tod Seelie - who create original pieces around three themes - escape, challenge, and empower - over a 24-hour period. The themes are inspired by the CT Hybrid, which challenges convention as the most fuel-efficient luxury hybrid available. Click 3X took the varied footage and stitched it into seamless narrative montages, capturing the essence of the diverse artistic talents with videos that are themselves supreme works of art.",
            "media_type":"1",
            "title":"Lexus",
            "filename":"LEXUS_2011_01"
         },
         {
            "id":"8",
            "description":"From chewing gum to Fantanna girls, we’ve created integrated marketing campaigns that prove that co-branded spots are the wave of the future.  In the past year, Click 3x’s VFX team has worked with MTV and their partners to spread the word and show how cutting edge CGI and compositing can make the impossible possible.",
            "media_type":"1",
            "title":"Orbit",
            "filename":"MTV_Orbit"
         },
         {
            "id":"9",
            "description":"From chewing gum to Fantanna girls, we’ve created integrated marketing campaigns that prove that co-branded spots are the wave of the future.  In the past year, Click 3x’s VFX team has worked with MTV and their partners to spread the word and show how cutting edge CGI and compositing can make the impossible possible.",
            "media_type":"1",
            "title":"Fanta",
            "filename":"Fanta_post"
         }
      ],
      "related_links":[

      ],
      "client":"",
      "description":"View our brand integration montage.",
      "detail_name":"portfolio/brand_integration",
      "title":"Brand Integration",
      "filename":"BrandIntegrationReelFINAL"
   }
}