{
   "post_detail":{
      "related_posts":[

      ],
      "assets":[
         {
            "id":"1",
            "description":"View our broadcast reel.",
            "media_type":"1",
            "title":"Broadcast Design",
            "filename":"C3X_ENTERTAINMENT_MONTAGE_FALL2011"
         },
         {
            "id":"2",
            "description":"The 2012 VMA’s begin at year zero. Year zero is the age of remixing, mashups, deconstructing, reconstructing, interactive gaming, transcending and transforming.  Welcome to a time where creativity and technology are within everyones reach and can change the world in a millisecond.  Welcome to the 2012 MTV Video Music Awards.\n\nOur on-air image campaign for the 2012 MTV VMAs reflects this new ethos and embraces a world of transformative possibilities. Focusing on VMA talent to take us through this journey, we have created a :30 second image campaign that focused on what makes artists such as Pink, Taylor Swift, Alicia Keys, One Direction and Kanye West what they are.  With each individual spot, as we focus closely on the talent, visualizations deconstruct and reconstruct around them, as various different objects that represent core artistry, creative significance, animal spirit, as well as what the VMAs are all about - all the while changing and transforming to the beat of each artist's biggest, newest track.  And in a flash, it all sucks back and we find our stars on stage, tapping into these powers to transform into the artists that they are.\n\nTo achieve this, C3X teamed up with MTV Director Micah Perta and Creative Director Thomas Berger to board out the promo prior to the shoot, thus ensuring that we captured the proper essence.  Leading the charge for Click 3X was Creative Director Mark Szumski, Art Director Miguel Hernandez, and Editor Jeremy Baumann, who have overseen the VFX, design, and editorial components of the job, respectively.  Upon completion of the edit, animation and compositing was done both in After Effects and Flame to achieve the proper style and aesthetic.",
            "media_type":"1",
            "title":"VMAs 2012",
            "filename":"083012_MTV_VMA_30_LARGE_LIVE_MASTE"
         },
         {
            "id":"3",
            "description":"Lifetime inspired itself. Then it asked us to inspire its audience.  To do that we created a dynamic, illustrative, type driven animation for its brand new series 'My Life is a Lifetime Movie,' an original hybrid unscripted series focusing on people who could have been the subject of one of Lifetime's trademark telefilms.",
            "media_type":"1",
            "title":"Lifetime",
            "filename":"C3X_Life_Time_Movie_60_ProRes"
         },
         {
            "id":"4",
            "description":"Click 3X is proud to have contributed to the highest rated broadcast in US Television history in this year's Super Bowl.  Working with CBS Sports, our team created an all-new NFL animation package that reflects all of the beauty, star power and suspense of America's favorite sport. This NFL on CBS in-game toolkit, included logo, image, and game packaging, and will be adopted moving forward with the 2013-2014 season as CBS' main NFL animation package.",
            "media_type":"1",
            "title":"Super Bowl 2013",
            "filename":"SUPERBOWL_NEW4"
         },
         {
            "id":"5",
            "description":"Mark Szumski, who acted as Click 3X creative director, senior VFX artist and colorist on the campaign, teamed up with Backyard Director Kim Nguyen and MTV on-air producer Kris Walter to deliver edit, GFX, visual effects and color grading on these hilarious action spoofs starring 2013 VMA host Rebel Wilson and actor Channing Tatum.",
            "media_type":"1",
            "title":"MTV Movie Awards",
            "filename":"mtv_bra_30"
         },
         {
            "id":"6",
            "description":"Brooklyn is rising!  The bid day is finally here, so to help kickoff the Brooklyn Nets inaugural season, The YES Network brought in Click 3X to help usher the organization into a new era with a series of launch promos and promo toolkit for the 2012-2013 season.",
            "media_type":"1",
            "title":"Brooklyn Nets",
            "filename":"Yes_Nets_30_promo_1"
         },
         {
            "id":"7",
            "description":"To promote the launch of Season Four of The League, Click 3X teamed up with FX to conceive and edit a series of six promo teases.  Set up as a parody of Wrangler's Brett Favre campaign, each character's scene features gut-busting improv, snappy dialogue, and the wide-eyed commitment of the actors, all aimed at keeping you laughing throughout.",
            "media_type":"1",
            "title":"The League",
            "filename":"League4_skinnyandre"
         },
         {
            "id":"8",
            "description":"When Wing Latino turned to Click3X to animate their clever 'Movie Recipe' campaign for the New York Latino Film Festival, Click3X was already heating up the oven. We were able to turn their print ad into a fully animated spot, incorporating 2D character animations that brought the campaign from page to screen. With the help of Heard City, we finished off with sound design, editing and mixing, giving the spot the zest it needed, making this a Grade A finish. These spots will be aired on TV, on the New York Latino International Film Fest website, and at the film festival before the opening credits.",
            "media_type":"1",
            "title":"Latin Film Fest",
            "filename":"NYLatinFilm"
         },
         {
            "id":"9",
            "description":"Hot on the heels of last year's successful PBS Arts Fall Festival, PBS and Click 3x have once again joined forces to excite the masses about this year's PBS Arts Summer Festival with a comprehensive promo package.   \n\nWith elegant brush strokes leading the way, this season's promo package features star studded footage that travels the world, lending to a much larger scale and scope.",
            "media_type":"1",
            "title":"Summer Fest",
            "filename":"051512_PBS_post"
         }
      ],
      "related_links":[

      ],
      "client":"",
      "description":"View our broadcast reel.",
      "detail_name":"portfolio/broadcast_design",
      "title":"Broadcast Design",
      "filename":"C3X_ENTERTAINMENT_MONTAGE_FALL2011"
   }
}