{
   "post_detail":{
      "detail_name":"portfolio/4400_campaign",
      "filename":"CS01_4400_Approval",
      "related_posts":[

      ],
      "client":"",
      "related_links":[

      ],
      "description":"What this case study demonstrates: \nOur ability to launch a fully-integrated marketing campaign for a television show. \nOur ability to efficiently produce a high volume of content across media. \n\nChallenge:\nUSA Network, looking to promote the fourth season of their TV series “The \n4400”, worked with Campfire and Click3x for a multi-platform campaign \naimed at exiting existing viewers as well as piquing interest in a new \naudience. \n\nExecution:\nPromicin is a fictional substance featured in the series that either kills those\n who inject it, or gives them super-human abilities. Campfire and \nClick3x launched “The Battle Over Promicin”, a multi-platform campaign \nthat debated the use of this fictional drug as if it were real news. \nClick3x produced over 40 videos, dozens of blog and rich media banners, 3\n websites as well as wild postings. The campaign evolved after the \ninitial launch and many additional elements were fed itno the campaign \nas the audience responded, including  additional viral websites, videos,\n wild postings, and interactive banners. \n\nResults\nThe campaign successfully drove attention for both ardent fans as well as attracted new viewers. \nClick 3X successfully produced a high volume of branded content across media in a short time frame and very cost-efficiently.  \nThe campaign went viral, being spread through hardcore fans and picked up by traditional media sources.",
      "title":"4400 Campaign",
      "assets":[
         {
            "id":"1",
            "description":"",
            "filename":"CS01_4400_Approval",
            "title":"",
            "media_type":"1"
         },
         {
            "id":"2",
            "description":"",
            "filename":"4400_1_bc",
            "title":"",
            "media_type":"1"
         }
      ]
   }
}