{
   "post_detail":{
      "related_posts":[

      ],
      "assets":[
         {
            "id":"1",
            "description":"",
            "media_type":"1",
            "title":"",
            "filename":"GoodskinLabs"
         },
         {
           "id":"2",
            "description":"",
            "media_type":"1",
            "title":"Zpore",
            "filename":"Zpore8_23_v2"
            },
             {
           "id":"3",
            "description":"",
            "media_type":"1",
            "title":"GoodskinLabs Dr. Frank Facebook App",
            "filename":"drfranktabv3"
            },
                 {
           "id":"4",
            "description":"",
            "media_type":"1",
            "title":"Equinol",
            "filename":"equinol"
            }
      ],
      "related_links":[
{"href":"https://www.facebook.com/GoodSkinLabs/app_349753975138034", "title":"Goodskin Facebook"}
      ],
      "client":"Beauty Bank",
      "description":"<h2>Challenge:</h2> \nClickFireMedia was challenged by GoodSkin Labs to create a cutting-edge online diagnostic tool to allow users to explore the full array of Goodskin Labs products. <h2>\nExecution:</h2> \nClickFire created a cutting-edge online diagnostic tool to allow users to interact with and explore the different products under the GoodSkin Labs hierarchy. Our goal was to personalize the interactive experience to make it different than other standard skincare quizzes.\nUsers can upload their photo via Facebook Connect or from their computer so they can easily identify and prioritize problem areas. After completing the experience, you can download or email yourself your personalized “prescription” that explains your skincare solutions, the product information and also links to kohls.com where you can make your purchase. The experience is shareable and allows users to easily send an email or post it to their Facebook newsfeed. We also resized the tool for a customized Facebook tab to provide content for the brand page’s fans and link back to the site.",
      "detail_name":"portfolio/goodskin_labs",
      "title":"Goodskin Labs",
      "filename":"GoodskinLabs"
   }
}