{
   "post_detail":{
      "related_posts":[

      ],
      "assets":[
         {
            "id":"1",
            "description":"",
            "media_type":"1",
            "title":"",
            "filename":"Hostess_trailer_edit"
         },
         {
            "id":"2",
            "description":"",
            "media_type":"1",
            "title":"",
            "filename":"coworkersv4"
         },
         {
            "id":"3",
            "description":"",
            "media_type":"1",
            "title":"",
            "filename":"mrrightv2"
         },
         {
            "id":"4",
            "description":"",
            "media_type":"1",
            "title":"",
            "filename":"motivational speaker"
         }
      ],
      "related_links":[

      ],
      "client":"Bernstein Rein",
      "description":"<h2>What This Case Study Demonstrates</h2><p>Our ability to combine our technology talents with our live action film production capabilities to produce personalized, interactive covideos with a higher audience engagement.</p> <h2>Challenge</h2><p>Bernstein Rein came to Click3x for a complete content production package that included live action production with comedy directors Josh Ruben & Vincent Peone, full post production and sound design as well as full development of a Facebook tab and interactivity within each video. The 6 videos and the trailer video celebrate the every day accomplishments of each viewer, pulling information from their connected Facebook account.</p><h2>Execution</h2><p>CFM brought on comedy director team Josh Ruben and Vincent Peone to film six videos during one full day shoot on location. All editorial, sound design and interactive programming was done by our in-house staff. Using the Facebook API, when a viewer connects their Facebook account to the video app we created on the Hostess Facebook brand page, certain user profile information and friend’s images were seamlessly incorporated into the videos, resulting in an impressive personalized video, with the apperance that each video was custom-made for each user.</p>",
      "detail_name":"portfolio/hostess_jv",
      "title":"Hostess Snackisodes J+V",
      "filename":"Hostess_trailer_edit"
   }
}