{
   "post_detail":{
      "related_posts":[

      ],
      "assets":[
         {
            "id":"1",
            "description":"What We Did:\n        \nFacebook Tab/Social Community Page\n\nHow We Did It:\n\nChallenge:\n\nClickFireMedia was tasked by their client, Digital Brand Architects, to create a community page for 7 For All Mankind using the ThisMoment platform.\n\nExecution:\n\nCFM used the ThisMoment CMS platform API to combine content from 7 For All Mankind's Pinterest, Instagram, Facebook, Twitter, and blog pages into one combined brand experience.",
            "media_type":"1",
            "title":"7 For All Mankind",
            "filename":"CS_7FAM"
         },
         {
            "id":"2",
            "description":"ClickFire Media was challenged by AFS to build a fully functional social media site to be used by current and former foreign exchange students.",
            "media_type":"1",
            "title":"AFS",
            "filename":"CS_AFS"
         },
         {
            "id":"3",
            "description":"As part of a Breast Cancer Awareness campaign, ClickFire Media was challenged by Digital Brand Architects (DBA) to build a Facebook application that raised awareness for breast cancer through illumination events and messages of hope and support.",
            "media_type":"1",
            "title":"Estee Lauder",
            "filename":"CS_BCA_"
         },
         {
            "id":"4",
            "description":"ClickFire Media - with an assist from sister sound studio Sounds Like Click - ran with the challenge, creating an engaging, shareable Facebook campaign that evokes the famous Little Tikes toys while raising money for the Sea Turtle Conservancy through games, social apps, sweepstakes, turtle-naming activities, donation information, and up-to-date news and information about the efforts.",
            "media_type":"1",
            "title":"Little Tikes",
            "filename":"CS_LITT"
         },
         {
            "id":"5",
            "description":"ClickFire Media was engaged by Vice to create a unique social  media experience for the event, focusing on Twitter.",
            "media_type":"1",
            "title":"Intel",
            "filename":"CS_VICE"
         },
         {
            "id":"6",
            "description":"ClickFire Media was challenged by their client BBDO/NY to create a Facebook app for their client, Pedigree.  The app, Pedigree Woofer, serves as a social media tool to help with pet adoption.",
            "media_type":"1",
            "title":"Pedigree",
            "filename":"CS_BBDO"
         },
         {
            "id":"7",
            "description":"Challenge:\nClickFire Media was challenged by Devito/Verdi to create a Facebook app for Daffy's 50th birthday.",
            "media_type":"1",
            "title":"Daffy's",
            "filename":"CS_ATT_"
         },
         {
            "id":"8",
            "description":"Challenge: \nClickFire Media worked with The Martin Agency to build a mobile app for their client, GEICO.  The app features the GEICO Gecko as a ventriloquist.",
            "media_type":"1",
            "title":"GEICO Ventriloquist",
            "filename":"CS_GEIC"
         }
      ],
      "related_links":[

      ],
      "client":"",
      "description":"",
      "detail_name":"portfolio/innovations",
      "title":"Innovations",
      "filename":"CS_7FAM"
   }
}