{
   "post_detail":{
      "related_posts":[

      ],
      "assets":[
         {
            "id":"1",
            "description":"",
            "media_type":"1",
            "title":"",
            "filename":"CS09_JENNIE-O_approval"
         },
         {
            "id":"2",
            "description":"",
            "media_type":"1",
            "title":"",
            "filename":"Best_of_JA_bc"
         },
         {
            "id":"3",
            "description":"",
            "media_type":"1",
            "title":"",
            "filename":"Contest"
         },
         {
            "id":"4",
            "description":"",
            "media_type":"1",
            "title":"",
            "filename":"evangelist"
         },
         {
            "id":"5",
            "description":"",
            "media_type":"1",
            "title":"",
            "filename":"Make_Burgers"
         },
         {
            "id":"6",
            "description":"",
            "media_type":"1",
            "title":"",
            "filename":"Puppet_Theatre"
         },
         {
            "id":"7",
            "description":"",
            "media_type":"1",
            "title":"",
            "filename":"Turkey_Burger_Converts"
         }
      ],
      "related_links":[

      ],
      "client":"",
      "description":"<h2>What this case study demonstrates:</h2><p>Our ability to combine event production with interactive development and video production. Our ability to collaborate amongst many different agency and client partners</p><h2>Challenge:</h2><p>Clickfire Media worked with BBDO and their client, Jennie-O, to produce a five-day, online and offline, multi-location marketing promotion across New York City.  The goal was to create social buzz, brand awareness, positive social chatter, and increase social following. We paired up with a popular food truck (Bistro Truck), and handed out thousands of free turkey burgers in an effort to get New Yorkers to \"Make The Switch\" to Jennie-O turkey. </p><h2>Execution:</h2><p>Unique burger recipes using the Jennie-O product were created by Bistro Truck chef, Yassir, for each of 5 high-traffic locations in NYC. We casted an improv comedy host to interview participants on the street, and we filmed at a different location each day of the 5-day promotion. We also produced a “themed photo shoot,\" each day to add variety to the digital content for the Facebook page. For instance, for the Mulberry Street Burger, CFM took character portraits to create a vintage Hipstamatic or Instagram styled photos, which were uploaded to the Jennie-O page, where people were encouraged to like and tag themselves. CFM also shot, edited and produced a total of six creative videos encompassing everything from man-on-the-street style interviews to a day in the life of a Jennie-O turkey burger. All the music was original, composed by Click 3X Sound Designer Brian Scribinico.</p> <h2>Results:</h2><ul><li>2.5K+ turkey burgers handed out in 5 days</li> <li>Produced 6 creative videos, as well as man on the street Style footage for each day’s promotion for Facebook</li><li>1 million+ impressions on Facebook</li><li>The Jennie-O Facebook page grew by 35K+ likes in less than a month</li><li>25K+ of the likes came during the five-day promotion</li><li>Thousands of Facebook updates and tweets generated.</li></ul>",
      "detail_name":"portfolio/jennie_o",
      "title":"Jennie-O",
      "filename":"CS09_JENNIE-O_approval"
   }
}