{
   "post_detail":{
      "detail_name":"portfolio/jonathan_yi",
      "filename":"JonYi_Paris_DirCut_Conform",
      "related_posts":[

      ],
      "client":"",
      "related_links":[

      ],
      "description":"Jonathan Yi is a freelance director and cinematographer, most often working in the realms of commercial production and documentary. His client list in the advertising world includes Nike, Smirnoff, Visine, Kleenex, JetBlue, Stride, Trident, Kotex, Microsoft, SAP, TD Ameritrade, Schick and Pepcid, among many others.\n \nOutside of the ad space, Yi has directed three installments of HBO’s award-winning series East of Main Street and shot projects for Twisted Sister, Poison, Daniel Johnston, Mates of State and The Locust. Shift, a film that Jonathan shot, directed and produced, has also won many accolades and played in many film festivals.\n \nAs a director/cinematographer, Yi’s work has been showcased in such magazines as Creativity and Vice. MoMA at the AICP Awards honored him in 2006 for his work on Sushi for Monster.com.\n \nYi teaches 16mm and digital cinematography at NYU’s Tisch School of the Arts. He also consults for Canon USA, most recently on their 2011 Cinema EOS product line. His promo video for the EOS C300 went viral, gaining more than 270,000 plays and more than 4,500 Vimeo likes in less than one week.\n \nYi attended New York University’s Tisch School of the Arts Film Program.",
      "title":"Jonathan Yi",
      "assets":[
         {
            "id":"1",
            "description":"To get the word out about the new, sleek UltraBooks, Jonathan collaborated with Gawker Media for this co-branded promotion with the Gawker Media Gizmodo Shooting Challenge editorial series and Intel. \n\nThe campaign sent six celebrated photographers to cities around the globe to create a compelling portfolio based on a one-word theme and a specific technical photography challenge, while Yi filmed their journey. Former pro skier Scott Rinckenberger captured mountain biking and surfing in Costa Rica for the theme “sports” and the challenge “solarization”, while Ryan Russell set out to capture “competition” in the video-gaming culture in a San Francisco arcade. Douglas Sonders captured the style of Miami with a photoshoot using some of the most high profile luxury cars in the world, including a gold Lamborghini for his challenge of shooting cars. Steven Taylor, Taylor Davidson, and Diana Levine used everything from black and white cameras to iPhones to get the perfect shots in Paris, Boston and Austin covering themes of style, sports and music.\n\nWe also handled the editorial, graphics, compositing, and color correct work.",
            "filename":"JonYi_Paris_DirCut_Conform",
            "title":"Gawker Paris",
            "media_type":"1"
         },
         {
            "id":"2",
            "description":"Jonathan shot and directed this docu-style video for SAP. The video was part of a mini-series, which highlighted SAP's Customer Success Stories, which also included Skullcandy, Forbes and Tommy Hilfiger, among others.",
            "filename":"SAP_Pinkberry",
            "title":"Pinkberry",
            "media_type":"1"
         },
         {
            "id":"3",
            "description":"Jonathan worked with HBO to produce, direct and shoot a new PSA/Doc Series from the ground up, which included this doc on Willy Santos. The series, “East of Main Street: Asians Aloud,” premiered on HBO and was met with critical acclaim and strong viewership numbers. It went on to win the 2010 NAMIC Excellence in Multicultural Marketing Award (EMMA). The campaign was also honored by the Mark Awards for Multicultural or Alternative Audience Development – Digital Media.",
            "filename":"HBO_WillySantos",
            "title":"HBO Willy Santos",
            "media_type":"1"
         },
         {
            "id":"4",
            "description":"Jonathan worked with HBO to produce, direct and shoot a new PSA/Doc Series from the ground up, which included this doc on award-winning chef, Anita Lo. The series, “East of Main Street: Asians Aloud,” premiered on HBO and was met with critical acclaim and strong viewership numbers. It went on to win the 2010 NAMIC Excellence in Multicultural Marketing Award (EMMA). The campaign was also honored by the Mark Awards for Multicultural or Alternative Audience Development – Digital Media.",
            "filename":"HBO_superstar",
            "title":"HBO Anita Lo",
            "media_type":"1"
         },
         {
            "id":"5",
            "description":"Jonathan shot and directed this docu-style video for SAP. The video was part of a mini-series, which highlighted SAP's Customer Success Stories, which also included Pinkberry, Forbes and Tommy Hilfiger, among others.",
            "filename":"SAP_Skullcandy_mod_112510.",
            "title":"Skullcandy",
            "media_type":"1"
         },
         {
            "id":"6",
            "description":"To get the word out about the new, sleek UltraBooks, Jonathan collaborated with Gawker Media for this co-branded promotion with Gawker Media’s Gizmodo Shooting Challenge editorial series and Intel. \n\nThe campaign sent six celebrated photographers to cities around the globe to create a compelling portfolio based on a one-word theme and a specific technical photography challenge, while Yi filmed their journey. Former pro skier Scott Rinckenberger captured mountain biking and surfing in Costa Rica for the theme “sports” and the challenge “solarization”, while Ryan Russell set out to capture “competition” in the video-gaming culture in a San Francisco arcade. Douglas Sonders captured the style of Miami with a photoshoot using some of the most high profile luxury cars in the world, including a gold Lamborghini for his challenge of shooting cars. Steven Taylor, Taylor Davidson, and Diana Levine used everything from black and white cameras to iPhones to get the perfect shots in Paris, Boston and Austin covering themes of style, sports and music.\n\nWe also handled the editorial, graphics, compositing, and color correct work.",
            "filename":"Gawker_SF",
            "title":"Gawker San Francisco",
            "media_type":"1"
         }
      ]
   }
}