{
   "post_detail":{
      "detail_name":"portfolio/Mikillstokk",
      "filename":"Mikillstokk",
      "related_posts":[

      ],
      "client":"",
      "related_links":[

      ],
      "description":"<h2>Challenge:</h2>ClickFire Media created a facebook app for the holiday season as a part of the Click 3X facebook page. Mikillstokk included three videos starring employees to give a personal greeting card look. Visual effects were used to make Nick Agderian look similar to the the characters in ‘Elf Yourself’ greeting cards that are popular online during the holidays.<h2>Execution:</h2>This Click 3X virtual holiday card allowed facebook friends and family to send each other the ‘Mikillstokk’ and watch as Nick delivered the present from a google street view of their home to a google street view of the recipient’s home. This app integrated google maps in an interesting way by using Google Earth to see the path and miles in distance. The street view created a personalized result. Not only is the card entertaining with the music, titles, and VFX in the videos and fun for friends to share, but there was a good cause behind the app. You can see to the right of the video there is a mileage goal of a million miles. The app counted the distances of the users delivery route and promised a $4,000 donation to the victims of Hurricane Sandy if the goal was met.<h2>Results:</h2>The million mile goal was met. Users on facebook gave presents to their facebook friends and their friends in return used the app to share with other friends. The video was popular because of the comedic execution of the videos, the good cause, and the innovation of using google maps.",
      "title":"Mikillstokk",
      "assets":[
         {
            "id":"1",
            "description":"",
            "filename":"Mikillstokk",
            "title":"Mikillstokk",
            "media_type":"1"
         },
          {
            "id":"2",
            "media_type":"1",
            "description":"",
            "title":"Mikillstokk Trailer",
            "filename":"Mikillstokk_trailer"
         },
          {
            "id":"3",
            "media_type":"1",
            "description":"",
            "title":"Mikillstokk_WTFM",
            "filename":"Mikillstokk_WTFM"
         },
              {
            "id":"4",
            "media_type":"1",
            "description":"",
            "title":"Mikillstokk_WWGD",
            "filename":"Mikillstokk_WWGD"
         }
      ]
   }
}