{
   "post_detail":{
      "related_posts":[

      ],
      "assets":[
         {
            "id":"1",
            "description":"Juan's animation montage covers a wide array of spots for short films, commmercials and promo spots. Juan's mediums include: traditional animation, Flash, After Effects, 3-D and Stop Motion.",
            "media_type":"1",
            "title":"Juan's Reel",
            "filename":"Animation_FlyLo_Final_071211v3"
         },
         {
            "id":"2",
            "description":"This spot was part of a larger campaign built around the notion that AT&T can tie all of your different technological needs together into one bundle. As is usual with his work, he used specially built props and augmented them with CG elements. The result is a whimsical metaphor for wrapping all your needs into one stream. Directed & Animated by Simon Blake.",
            "media_type":"1",
            "title":"AT&T Spool",
            "filename":"ATT_Spool_30"
         },
         {
            "id":"3",
            "description":"Starting with paper cutouts, adding tiny miniatures, and CG elements for the molecular, Simon created this campaign that plunges us into the DNA of Coke. Directed & Animated by Simon Blake.",
            "media_type":"1",
            "title":"Coke DNA",
            "filename":"Coca_Cola_DNA_30"
         },
         {
            "id":"4",
            "description":"Actors for this spot were shot in live action. The frames were printed out on paper, then cut up and combined digitally to create this spot for Microsoft Encarta. Directed & Animated by Simon Blake.",
            "media_type":"1",
            "title":"Microsoft Glen",
            "filename":"Microsoft_Glen_30"
         },
         {
            "id":"5",
            "description":"This spot was first created using drawings. He photographed a rotating globe as well as a detailed model plane. Then, printouts were pasted inside a real passport that had been turned into a flipbook. All this was augmented in Flame to create a unique and beautiful spot for United Airlines. Directed and animated by Simon Blake.",
            "media_type":"1",
            "title":"United Airlines",
            "filename":"United_Airlines"
         },
         {
            "id":"6",
            "description":"Combining still photography and CG elements in Flame, we created this whimsical spot for Mejier.",
            "media_type":"1",
            "title":"Meijer What Springs Up",
            "filename":"Meijer_WhatSpringsUp"
         },
         {
            "id":"7",
            "description":"Directed by Mark Szumski, we produced a 15-day stop motion shoot on our stage. Then composited the VFX in Flame with some CG characters we created in Maya.",
            "media_type":"1",
            "title":"LEGO Star Wars",
            "filename":"LEGO_STAR_WARS_CLICK3X_VERSION"
         },
         {
            "id":"8",
            "description":"When Wing Latino turned to Click3X to animate their clever 'Movie Recipe' campaign for the New York Latino Film Festival, Click3X was already heating up the oven. We were able to turn their print ad into a fully animated spot, incorporating 2D character animations that brought the campaign from page to screen. With the help of Heard City, we finished off with sound design, editing and mixing, giving the spot the zest it needed, making this a Grade A finish. These spots will be aired on TV, on the New York Latino International Film Fest website, and at the film festival before the opening credits.",
            "media_type":"1",
            "title":"Latin Film Festival",
            "filename":"NYLatinFilm"
         }
      ],
      "related_links":[

      ],
      "client":"",
      "description":"",
      "detail_name":"portfolio/motion_graphics_design",
      "title":"Traditional Animation",
      "filename":"Animation_FlyLo_Final_071211v3"
   }
}