{
   "post_detail":{
      "detail_name":"portfolio/mtv_vma_2009",
      "filename":"mtv_vma_2009",
      "related_posts":[
 {
            "id":"220",
            "description":"",
            "filename":"083012_MTV_VMA_30_LARGE_LIVE_MASTER_30FPS_C",
            "title":"VMAs 2012",
            "media_type":"1",
            "page":"portfolio",
            "category":"broadcast_entertainment"
         },
                  {
            "id":"1370",
            "description":"",
            "media_type":"1",
            "title":"MTV VMAs 2011",
            "filename":"MTV_Lady_Gaga_VMA_2011",
            "page":"portfolio",
            "category":"broadcast_entertainment"
         }
      ],
      "client":"MTV",
      "related_links":[

      ],
      "description":"Click 3X, led by VFX Supervisor/Lead Flame Artist Mark Szumski created a series of promotional spots for the 2009 MTV Video Music Awards that celebrate the show's return to New York City.  The videos pay homage to the theatrical classic musical West Side Story, featuring show host Russell Brand and VMA-nominated musicians performing a recreation of the signature tune 'Tonight' throughout a series of original Manhattan sets. The spots were produced individually and then edited together as one fully-mixed anthem.  Each have a distinct look and feature some of the biggest names in the music business belting out a hope-filled tune in anticipation of the night ahead. Ne-Yo, in classic Michael Jackson-style attire dances his way through a graffiti-laced junkyard.  Swanky Katy Perry hustles up an attitude in a rooftop garden. Glamorous Taylor Swift sings in the rain out of the open window of a taxi.  Cobra Starship slams through the Subway in a musical parade while Leighton Meester sings on the steps.  And a cane-swinging Russell Brand sings about the awaiting night's events through the city's gritty backstreets.  Each of the bits uses the network's iconic spaceman statuettes, a hallmark of the VMAs since their inception. Our team literally had to change the world with each shoot.  Working between two Flames and CGI pulling together a variety of elements, each scene had a distinct set of needs, ranging from providing atmosphere, creating skyline elements in CGI, lighting changes, and even compositing shots from multiple days.   Katy Perry's New York skyline was composited behind her on blue screen.  The interior of a Brooklyn studio became a junkyard beneath the Brooklyn Bridge for Ne-Yo's spot.  Using HDRI imagery, we transformed a daytime shot of a downtown Manhattan back alley into Russell Brand's nighttime jaunt to Radio City Music Hall.  Taylor Swift's stunning Times Square cab ride was shot in a Nashville studio. The end result is a music video setting the energy and tempo for a Video Music Award to be remembered.",
      "title":"MTV VMA 2009",
      "assets":[
         {
            "id":"1",
            "description":"",
            "filename":"mtv_vma_2009",
            "title":"MTV VMA 2009",
            "media_type":"1"
         }
      ]
   }
}