{
   "post_detail":{
      "related_posts":[

      ],
      "assets":[
         {
            "id":"1",
            "description":"Challenge: \nClickFireMedia was challenged by BBDO/NY to create a Facebook app for their client, Pedigree. The Pedigree Woofer Facebook app is a social adoption tool, which displays photos of shelter dogs in need of a loving home. \n\nExecution: \nCFM used the Instagram API to develop this photo-aggregation app. Shelter admin users could post photos of their dogs along with captions and searchable hashtags to Instagram. Then, it would be automatically displayed on the Facebook app. Pedigree’s Facebook fans could then sort and browse the listings, based on breed, age, gender, size and location.  All the listings also included full shareability with Facebook and Twitter.",
            "media_type":"1",
            "title":"Pedigree",
            "filename":"pedigreecasestudyv2"
         },
         {
            "id":"2",
            "description":"Challenge:\nClickFireMedia was challenged by Sharp Electronics to create a Facebook application that showcased Sharp’s home theater line, which includes their 60, 70, 80 and 90-inch AQUOS TVs.  \n\nExecution:\nTo commemorate the start of football season, CFM developed a Facebook app that encouraged Sharp's fans to create their ultimate tailgate experience.  The app was integrated into a month-long Facebook contest. After customizing their tailgate with team colors, decorations, personalized pictures, and a half-time video, users submitted their party and were eligible to win real-world prizes. Fans could win one of three big screen AQUOS LED TVs as well as all the goodies necessary to truly bring the ultimate tailgate experience to life this football season. The app was fully shareable through Facebook, Twitter, and email, and fans were encouraged to get their friends to vote by liking their tailgate.",
            "media_type":"1",
            "title":"Sharp AQUOS App",
            "filename":"SharpAppv4_final"
         },
         {
            "id":"3",
            "description":"",
            "media_type":"1",
            "title":"",
            "filename":"CFM_Roxy_CS"
         },
         {
            "id":"4",
            "description":"Challenge:\nClickFire Media was challenged by Big Fuel to create a unique car customizer Facebook app for their client, Chevrolet for their Sonic car line.\n\nExecution:\nThe app allows users to decorate and customize a Chevy Sonic car. The user begins by selecting a background or uploading their own from their computer. They can select the car color, add car “wraps,” decals, window tints and wheels. Users also had the option to touch-up and/or paint their own patterns and decals too. After the user creates their car, they will be able to save their image to a gallery. Viewers can also browse through the gallery and rate the submitted customized cars. Each image is also fully shareable on Facebook, Twitter and email.",
            "media_type":"1",
            "title":"Chevy Sonic",
            "filename":"chevysonicv2"
         },
         {
            "id":"5",
            "description":"What We Did:\n        \nFacebook Tab/Social Community Page\n\nHow We Did It:\n\nChallenge:\n\nClickFireMedia was tasked by their client, Digital Brand Architects, to create a community page for 7 For All Mankind using the ThisMoment platform.\n\nExecution:\n\nCFM used the ThisMoment CMS platform API to combine content from 7 For All Mankind's Pinterest, Instagram, Facebook, Twitter, and blog pages into one combined brand experience.",
            "media_type":"1",
            "title":"7 For All Mankind",
            "filename":"CS_7FAM"
         },
         {
            "id":"6",
            "description":"Challenge: \nClickFire Media was challenged by Big Fuel to create a Facebook application for their client, Samsung. The app was designed to showcase features on the new line of Samsung Cameras. \n\nExecution: \nCFM developed an app,  which mimics the functionality of several features in the new cameras. These features included a robust-zoom, dual view and smart filters.   \nUsers began by either taking a photo from their webcam or uploading a photo from their Facebook page. The selected photo would then be displayed on the front of the camera. Users could then explore and navigate the camera’s features in real time. This included the ability to zoom in and out as well as adding dynamic filters. Once finished, users were encouraged to save and share the photo on Facebook, Twitter and via email. All the finished photos were saved inside a gallery within the app. \n\nResults: \n4,600 pageviews\n2,300+ unique visitors  \nAverage time spent in the app: 4+ mins.",
            "media_type":"1",
            "title":"Samsung Camera",
            "filename":"samsung_camera"
         },
         {
            "id":"7",
            "description":"Challenge: \nClickFireMedia was challenged by GoodSkin Labs to create a custom blog tab on their Facebook page titled, “Read Between The Lines with Dr. Paul Jarrod Frank\" to give users insights and tips on using GSL products.\n\nExecution:\nCFM created a custom Facebook tab for their editorial content. We developed a custom theme and used Wordpress so the page would have a simple CMS. The tab supports videos, quotes, fun facts, and articles. The content includes a monthly video series with GoodSkin Labs’ endorsed dermatologist Dr. Frank, seasonal tips and new product news. All the content is viewed within the tab to keep users engaged on the GoodSkin Labs Facebook page.",
            "media_type":"1",
            "title":"Dr. Frank Tab",
            "filename":"drfranktabv3"
         },
         {
            "id":"8",
            "description":"Background:\n        CFM worked with Vice and Air to create a photo contest Facebook app. Users could upload their photos directly through the app or by using the #airparties hashtag on Twitter, Flickr and Instagram. The app was part of an integrated campaign to launch Air, a vodka drink, through a series of West Coast summer dance parties. The winner of the contest receives an all-expense paid trip to Air’s big West Coast dance party finale in San Francisco.",
            "media_type":"1",
            "title":"Vice Air App",
            "filename":"vice_airappv2"
         },
         {
            "id":"9",
            "description":"Challenge:\nClickFireMedia was challenged to create a Facebook app, which used the Instagram API, for Gotham and their client, Denny's. \n\nExecution: \nThe Facebook app was designed as a 30 day photo contest that would take advantage of CFM's experience with the Instagram API.  Each day a new hashtag, based off Denny's and various food themes (#blueberries, #pancakes, #butter), was used for photo entries.  Users were encouraged to submit their photos with the correct hashtag of the day via Instagram, or upload them directly to the site.  Each day a winning photo is selected, and that user is given a $10 Denny's gift card.",
            "media_type":"1",
            "title":"Denny's",
            "filename":"dennys_app"
         },
         {
            "id":"10",
            "description":"Challenge: \nClickFireMedia was challenged by Bernstein Rein to produce a Facebook application with several interactive videos, for their client, Hostess.  This theme of the Facebook app was to encourage Twinkie and Hostess Cupcake lovers to celebrate the small milestones or celebrations in our day to day lives.\n\nExecution:\nCFM worked with College Humor director/DP team Josh Ruben and Vincent Peone to film six videos during one full day shoot. Hostess fans could go to the app, and write their latest accomplishments. Using the Facebook API, ClickFire Media pulled profile and friends images as well as the users' customized text. These assets were then match moved so that they were seamlessly integrated into the videos.  The end result was impressive, giving the appearance that the video was custom shot for the user.",
            "media_type":"1",
            "title":"Hostess",
            "filename":"coworkersv4"
         },
         {
            "id":"11",
            "description":"Challenge:\nClickFire Media was challenged to create a Facebook voting application for the second annual Social Media Society Influencer Awards. The Influencer Awards celebrate the year’s most highly touted social media campaigns, videos and profiles.\n\nExecution:\nCFM created an application that allowed fans to vote for their favorite social media campaigns without ever leaving the Social Media Society Facebook page. The landing tab featured a thumbnail image of each campaign. Before voting for their favorite projects, users could read a short case study as well as view project links. The winners were announced at a party during Social Media Week in New York City.\n\nResults:\n350 campaign submissions garnering 110,000 votes\nA 300% increase in site traffic,\n4,300 tweets sent\nPress coverage in prestigious trade magazines and blogs, as well as garnered additional exposure for the Social Media Society and it’s sponsors.",
            "media_type":"1",
            "title":"Influencer Awards",
            "filename":"InfluencerAwardsv3"
         }
      ],
      "related_links":[

      ],
      "client":"",
      "description":"Challenge:\nClickFireMedia was challenged by Sharp Electronics to create a Facebook application that showcased Sharp’s home theater line, which includes their 60, 70, 80 and 90-inch AQUOS TVs.  \n\nExecution:\nTo commemorate the start of football season, CFM developed a Facebook app that encouraged Sharp's fans to create their ultimate tailgate experience.  The app was integrated into a month-long Facebook contest. After customizing their tailgate with team colors, decorations, personalized pictures, and a half-time video, users submitted their party and were eligible to win real-world prizes. Fans could win one of three big screen AQUOS LED TVs as well as all the goodies necessary to truly bring the ultimate tailgate experience to life this football season. The app was fully shareable through Facebook, Twitter, and email, and fans were encouraged to get their friends to vote by liking their tailgate.",
      "detail_name":"portfolio/social",
      "title":"Social",
      "filename":"pedigreecasestudyv2"
   }
}