{
   "post_detail":{
      "related_posts":[

      ],
      "assets":[
         {
            "id":"1",
            "description":"",
            "media_type":"1",
            "title":"",
            "filename":"SPIKE_ADAH_FINAL"
         },
         {
            "id":"2",
            "description":"",
            "media_type":"1",
            "title":"",
            "filename":"SpikeTV_MakingOf_Full"
         }
      ],
      "related_links":[

      ],
      "client":"",
      "description":"Are you ready for SPIKE's biggest night of premieres?  Thanks to the hard-working teams at Spike and Click3x, you just might be!  On March 21st, Spike TV raises the stakes as for the first time ever the networks highest-rated non-scripted original series \"Auction Hunters\" premieres a special, one hour LIVE auction event. Showcasing two of the best prospectors in the business, Allen Haff and Ton Jones, the episode will broadcast LIVE from an exclusive storage auction in Los Angeles. Then, at 10/9c their newest original series, American Digger, shows you what it's like to feel history in the palm of your hands, as former professional wrestler-turned-modern- day relic hunter Ric Savage and his team scours target-rich areas, such as battlefields and historic sites, in hopes of striking it rich by unearthing and selling rare pieces of American history.\nTo create an eye-catching combo spot that would celebrate just how big this night was Spike turned to Click to help them visualize a heightened reality where the treasures of these programs could be translated into real dollars and cents.  Aaron Vasquez of Click 3x was on set in both Richmond, Virginia and Los Angeles, California, to supervise the shooting for all of the VFX plates for the promo.  These plates included shots of an excavator in Virginia and a storage facility in LA.  Plates were shot then later enhanced with CG cash and coins that were comped into shots both as large piles, as well as falling from the excavator claw.",
      "detail_name":"portfolio/spike_tv_promo",
      "title":"Spike TV Promo",
      "filename":"SPIKE_ADAH_FINAL"
   }
}