{
   "post_detail":{
      "related_posts":[
 {
            "id":"881",
            "description":"",
            "filename":"mtv_vma_2009",
            "title":"MTV VMA 2009",
            "media_type":"1",
            "page":"portfolio",
            "category":"broadcast_entertainment"
         },
                  {
            "id":"1370",
            "description":"",
            "media_type":"1",
            "title":"MTV VMAs 2011",
            "filename":"MTV_Lady_Gaga_VMA_2011",
            "page":"portfolio",
            "category":"broadcast_entertainment"
         }
      ],
      "assets":[
         {
            "id":"1",
            "description":"",
            "media_type":"1",
            "title":"",
            "filename":"083012_MTV_VMA_30_LARGE_LIVE_MASTER_30FPS_C"
         },
         {
            "id":"2",
            "description":"",
            "media_type":"1",
            "title":"",
            "filename":"VMAs_Pink_conform_2_MASTER_C"
         },
         {
            "id":"3",
            "description":"",
            "media_type":"1",
            "title":"",
            "filename":"TAYLOR_CONFORM_V15_MASTER"
         },
         {
            "id":"4",
            "description":"",
            "media_type":"1",
            "title":"",
            "filename":"VMAs_Alicia_CONFORM_V7_MASTER_30FPS_C"
         },
         {
            "id":"5",
            "description":"",
            "media_type":"1",
            "title":"",
            "filename":"VMA_1D_CONFORM_FULL_30FPS_C"
         },
         {
            "id":"6",
            "description":"",
            "media_type":"1",
            "title":"",
            "filename":"KANYE_1_8_MASTER_30FPS_C"
         }
      ],
      "related_links":[

      ],
      "client":"MTV",
      "description":"The 2012 VMA’s begin at year zero. Year zero is the age of remixing, mashups, deconstructing, reconstructing, interactive gaming, transcending and transforming.  Welcome to a time where creativity and technology are within everyone's reach and can change the world in a millisecond.  Welcome to the 2012 MTV Video Music Awards.\n\n\tOur on-air image campaign for the 2012 MTV VMAs reflects this new ethos and embraces a world of transformative possibilities. Focusing on VMA talent to take us through this journey, we have created a :30 second image spot that focused on what makes up the artist known as Pink.  As we focus closely on her, visualizations deconstruct and reconstruct around her, as various different objects that represent her core artistry, creative significance, animal spirit, as well as what the VMAs are all about - all the while changing and transforming to the beat of her biggest, newest track.  And in a flash, it all sucks back and we find her on stage, tapping into these powers to transform into the artist that she is.\n\n\tTo achieve this, C3X teamed up with MTV Director Micah Perta and Creative Director Thomas Berger to board out the promo prior to the shoot, thus ensuring that we captured the proper essence.  Leading the charge for Click 3X was Creative Director Mark Szumski, Art Director Miguel Hernandez, and Editor Jeremy Baumann, who have overseen the VFX, design, and editorial components of the job, respectively.  Upon completion of the edit, animation and compositing was done both in After Effects and Flame to achieve the proper style and aesthetic.",
      "detail_name":"portfolio/vmas_2012",
      "title":"VMAs 2012",
      "filename":"083012_MTV_VMA_30_LARGE_LIVE_MASTER_30FPS_C"
   }
}