{
   "post_detail":{
      "title":"I Like to Rock.",
      "client":"Singer/Songwriter/Multi-instrumentalist",
      "detail_name":"about/ored_music",
      "description":"<p>As a self-taught multi-instrumentalist, I play keyboard, drums, guitar, and I sing. Much of the music I perform is original songs. For over ten years, I have been putting together acoustic and full rock band projects. We perform in the NY Metro area at various locations, including historic venues such as The Bitter End, Kenny’s Castaways and The Highline Ballroom.</p><p>The writing of lyrics and music is a creative process through which I am able to express emotional content and themes in a way that is both personally therapeutic and inspiring. I also enjoy the recording process and find that sound design is yet another way to engage my creativity.</p><p>Working with a band is a collaborative experience that utilizes the team-building skills I have been developing my whole life playing organized sports. In college, I formed Ocelot Red with some classmates who became life-long friends. From 2005-2008, I put together another band, The Good News, that played monthly in New Jersey and NYC. At present, I play with a rotating lineup under the name Red Machine.</p><p>Perhaps the most exciting aspect of the role that music plays in my life is live performance. Performing on stage is a rewarding form of creative communication because it allows for a personal connection to be made with the audience. Through live performance, I am able to share my music in real time, as the culmination of months of writing and rehearsing. For me, the creative process is not complete until its product is shared with others.</p>",
      "related_posts":[
         {
             "id":"401",
             "media_type":"1",
             "filename":"ored_redmachine",
             "title":"Red Machine",
             "page":"music",
             "category":"redmachine"
         },
         {
             "id":"3",
             "media_type":"1",
             "filename":"ored_lll",
             "title":"The Good News",
             "page":"music",
             "category":"thegoodnews"
         },
         {
             "id":"13",
             "media_type":"1",
             "filename":"ored_jamwithtoast",
             "title":"",
             "page":"music",
             "category":"jwt"
         }
      ],
      "assets":[
         {
            "id":"1",
            "media_type":"2",
            "description":"",
            "title":"",
            "filename":"ored_rock"
         },
         {
            "id":"2",
            "media_type":"2",
            "description":"",
            "title":"",
            "filename":"ored_music"
         },
         {
            "id":"3",
            "media_type":"2",
            "description":"",
            "title":"",
            "filename":"ored_tgn"
         },
         {
            "id":"4",
            "media_type":"2",
            "description":"",
            "title":"",
            "filename":"ored_music1"
         },
         {
            "id":"5",
            "media_type":"2",
            "description":"",
            "title":"",
            "filename":"ored_music2"
         },
         {
            "id":"6",
            "media_type":"2",
            "description":"",
            "title":"",
            "filename":"ored_music3"
         },
         {
            "id":"7",
            "media_type":"2",
            "description":"",
            "title":"",
            "filename":"ored_music4"
         }
      ],
      "related_links":[
           {"href":"http://www.cdbaby.com/cd/thegoodnews", "title":"Buy Album"},
           {"href":"http://www.soundcloud.com/", "title":"Soundcloud"},
           {"href":"http://myspace.com/theredmachine", "title":"Myspace"}
      ],
      "filename":"ored_music"
   }
}