{
   "post_detail":{
      "title":"I Am Owen Corso",
      "client":"an Amazonian, Musician and Athlete",
      "detail_name":"people/owen_corso",
      "filename":"owen",
      "description":"<p>I am passionately driven to craft digital experiences in new and exciting ways. I am innovative and creative, and apply these qualities to my work and play.</p><p>I work at Amazon Web Services as a Product Manager on the AWS Cost Management team.</p><p>I previously worked at Google as a Creative Technical Consultant within Media & Technology Solutions. Prior to Google, I worked at a New York City based digital production studio called Click 3X. In my role as Lead Technologist, I exercised my technological acumen by using a variety of programs to accomplish client objectives. I applied my creative nature by playing a role in designing projects and finding innovative ways to bring them to life.</p><p>Music is another outlet for my creative energy.  I lead a NYC rock band called Red Machine. I compose original music and lyrics, and perform on guitar and lead vocals.</p><p>I am also an athlete. I play in various men’s lacrosse leagues throughout the year as a take-away long stick midfielder. I am and avid mountain biker, and I love to ski.</p><p>I grew up in northern New Jersey as the youngest of four boys. I continue to be motivated by my amazing mother, who raised us alone and with very little. In 2003, I earned a BS in Computer Science from Villanova University.</p><p>I am currently a resident of New York City. Living in this vibrant city gives me access to inspiring experiences and fuels my creative energy. I recently moved from the San Francisco Bay Area and worked in Silcon Valley which meant I was able to play a role in a constantly evolving start-up community. I embrace all opportunities to learn and to create.</p>",
      "assets":[
         {
            "id":"1",
            "media_type":"2",
            "description":"",
            "title":"",
            "filename":"owen"
         },
                  {
            "id":"2",
            "media_type":"2",
            "description":"",
            "title":"",
            "filename":"ored_owen1"
         }
      ],
      "related_posts":[],
      "related_links":[
         {"href":"http://ored.net/owen_corso_resume.pdf", "title":"Resume"}
      ]
   }
}