{
   "post_detail":{
      "title":"JWT wins Battle of the Ad Bands",
      "client":"JWT",
      "detail_name":"music/jamwithtoast",
      "filename":"ored_jamwithtoast",
      "description":"<h2>My Contribution:</h2><p>I got some of my fellow agency colleagues together to enter the contest.  I sang backup and play keyboards for the first song, a rock rendition of Lady Gaga's Bad Romance.  I sang lead vocals and played guitar for our second and final song, Billie Jean by Michael Jackson.</p><h2>Background</h2><p>I enjoy bringing people together and rallying them around a common cause. During my time at JWT, I have built friendships that extend beyond crafting award-winning marketing campaigns by participating in nearly every extra-curricular activity at the agency. For example, the JWT TalentShow, I performed an original song on harmonica and acoustic guitar echoing the internal mantra of the agency: 'Worldmade.'  After the talent show, I was approached by the head of PR to put together a band of colleagues for the heralded “Battle of the Ad Bands” competition that takes place annually during Agency Week. Naturally, I leapt at the idea and began canvassing musically talented friends at JWT. After some convincing, we assembled a group of musicians with diverse musical backgrounds. On the night of the event, I was slightly nervous, as this was the first time JWT had entered this competition and the Chief Creative Officer, Peter Nicholson, mentioned he was counting on us. JWT placed first out of nine bands after a cheering crowd determined us the victor in a tiebreaker with Euro RSCG Worldwide. Aside from the enjoyment of bringing the company together for a fun event, winning was a strategic move from a business and PR perspective because it demonstrated that JWT is not the traditional, irrelevant dinosaur in the advertising industry (according to some critics), but quite the contrary: a hip, trendy, close-knit team of talented creators.</>",
      "related_posts":[],
      "related_links":[
           {"href":"http://www.adweek.com/advertising-week/jwt-wins-battle-ad-bands-135484", "title":"AdWeek Press Release"}
      ],
      "assets":[
          {
            "id":"1",
            "description":"",
            "filename":"ored_jamwithtoast",
            "title":"",
            "media_type":"1"
          },
          {
            "id":"2",
            "description":"",
            "filename":"ored_jamwithtoast2",
            "title":"",
            "media_type":"2"
          }
      ]
   }
}