{
   "post_detail":{
      "detail_name":"portfolio/smirnoff",
      "filename":"ored_smirnoff",
      "related_posts":[

      ],
      "client":"Diageo",
      "related_links":[
         {"href":"http://staging.click3x.com/roxy/dare/fbtabpage/", "title":"Code on Github"}
      ],
      "description":"<h2>My Contribution:</h2><p>As lead flash developer, I managed a freelance developer as we programmed a flash movie that was projected on a giant screen at each of the 26 parties. </p><h2>Execution:</h2><p>The Nightlife Exchange Project rolled out in 14 countries and 6 continents around the world. We asked people in each country to submit the best of their local nightlife, which we packed into shipping crates (literally and figuratively) and exchanged in one epic global celebration on November 27, 2010, or as we called it, the day the world swapped nights.</p><p>This was more than a one-off party. By rallying our consumers to participate online and offline in the months leading up to the event, we created both a virtual and physical celebration of nightlife for our community of more than 3 million fans.</p><p>Continuing in Smirnoff's mission to inspire and enable more original nightlife experiences, Smirnoff invited consumers worldwide to contribute their ideas on what makes their local nightlife unique. The most inspiring ideas from each region were captured online through Facebook and will be exchanged with a partnering country tomorrow in an attempt to create a once-in-a-lifetime experience on the same night across the globe.</p><p>By connecting our global network and capabilities, we are able to help Smirnoff deliver a-one-of-a-kind nightlife experience that will be attracting more than 10 million participants across the world.</p><p>Globally, the campaign's reach has risen to epic proportions with 300 million+ media impressions, 8.4 million consumers in the Smirnoff digital community, and 100,000 ideas submitted to Smirnoff.com-- an outstanding feat that demonstrates the campaign's continued success.</p><p>From Argentina, Dubai, Ireland to Peru, tomorrow will be a night that millions will remember. Congratulations again to the Smirnoff Team for creating this first-of-its-kind program. It proves, yet again, the strength of worldmade and JWT.</p>",
      "title":"Smirnoff: Nightlife Exchange Project",
      "assets":[
         {
            "id":"1",
            "description":"",
            "filename":"ored_smirnoff",
            "title":"",
            "media_type":"1"
         },
         {
            "id":"2",
            "description":"",
            "filename":"ored_smirnoff2",
            "title":"",
            "media_type":"1"
         },
         {
            "id":"3",
            "description":"",
            "filename":"ored_smirnoff3",
            "title":"",
            "media_type":"1"
         },
         {
            "id":"4",
            "description":"",
            "filename":"ored_smirnoff4",
            "title":"",
            "media_type":"1"
         },
         {
            "id":"5",
            "description":"",
            "filename":"ored_smirnoff5",
            "title":"",
            "media_type":"1"
         },
         {
            "id":"6",
            "description":"",
            "filename":"ored_smirnoff6",
            "title":"",
            "media_type":"1"
         },
         {
            "id":"7",
            "description":"",
            "filename":"ored_smirnoff7",
            "title":"",
            "media_type":"1"
         },
          {
            "id":"8",
            "description":"",
            "filename":"ored_smirnoff8",
            "title":"",
            "media_type":"2"
         }
      ]
   }
}