{
   "post_detail":{
      "detail_name":"portfolio/starburst",
      "filename":"ored_starburst",
      "related_posts":[],
      "client":"Wrigley's",
      "related_links":[
           {"href":"https://github.com/ocorso/starburst_www", "title":"Code on Github"},
           {"href":"http://starburst.com", "title":"starburst.com"}
      ],
      "description":"<h2>My Contribution:</h2><p>As a developer on cross-disciplinary production team, Cheapies Playhaus, I performed back-end php development as well as front-end markup, AJAX and flash animation.</p><h2>Execution:</h2><p>Starburst is the perfect example of 'a juicy contradiction,' a solid-yet-juicy candy that entertains its audience with skinny sumo wrestlers, uncool cucumbers and other unexpected contradictions. In capturing the brand’s essence for the digital space, our goal was to expand on the campaign's success by inviting fans to immerse themselves in these contradictions. To that end, we worked with Starburst on a new digital presence that centered on all things contradictory.</p><p>Accessing content through Starburst.com or Facebook, fans can engage with contradictions in lighthearted, entertaining ways that spark conversations amongst friends. The video section on Starburst.com showcases a series of contradiction-spotting TV commercials and web videos, while the product area brings the ultimate contradiction to the forefront: Starburst Fruit Chews, which are solid yet juicy. The centerpiece, however, is the Contradictionary, an interactive exploration of all things contradictory. Like a pack of Starburst, a new contradiction awaits in every wrapper, from 'Boneless Ribs' to 'Clumsy Ninja.' Fans vote on their favorites or suggest their own through Starburst.com or the Starburst Facebook page, growing the resource. And with 2 million Facebook fans passionate about Starburst, we made sure every contradiction was easy to share across the social network as a quick conversation-starter.</p><p>Ultimately our goal was to make Starburst’s entire digital presence a contradiction: a clever confection.</p>",
      "title":"Starburst: Contradictionary",
      "assets":[
          {
            "id":"1",
            "description":"",
            "filename":"ored_starburst1",
            "title":"",
            "media_type":"2"
          },
          {
            "id":"2",
            "description":"",
            "filename":"ored_starburst2",
            "title":"",
            "media_type":"2"
          },
          {
            "id":"3",
            "description":"",
            "filename":"ored_starburst3",
            "title":"",
            "media_type":"2"
          },
          {
            "id":"4",
            "description":"",
            "filename":"ored_starburst4",
            "title":"",
            "media_type":"2"
          },
          {
            "id":"5",
            "description":"",
            "filename":"ored_starburst5",
            "title":"",
            "media_type":"2"
          },
          {
            "id":"6",
            "description":"",
            "filename":"ored_starburst6",
            "title":"",
            "media_type":"2"
          },
          {
            "id":"7",
            "description":"",
            "filename":"ored_starburst7",
            "title":"",
            "media_type":"2"
          },
          {
            "id":"8",
            "description":"",
            "filename":"ored_starburst8",
            "title":"",
            "media_type":"2"
          },
          {
            "id":"9",
            "description":"",
            "filename":"ored_starburst9",
            "title":"",
            "media_type":"2"
          }
      ]
   }
}